CSI API ETABS v1
cPropMaterial.GetMPIsotropic Method
 Retrieves the mechanical properties for a material with an isotropic directional symmetry type.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMPIsotropic(
	string Name,
	ref double E,
	ref double U,
	ref double A,
	ref double G,
	double Temp = 0
)
Function GetMPIsotropic (
	Name As String,
	ByRef E As Double,
	ByRef U As Double,
	ByRef A As Double,
	ByRef G As Double,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim E As Double
Dim U As Double
Dim A As Double
Dim G As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.GetMPIsotropic(Name,
	E, U, A, G, Temp)
int GetMPIsotropic(
	String^ Name,
	double% E,
	double% U,
	double% A,
	double% G,
	double Temp = 0
)
abstract GetMPIsotropic :
        Name : string *
        E : float byref *
        U : float byref *
        A : float byref *
        G : float byref *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing material property.
E
Type: System.Double
The modulus of elasticity. [F/L2]
U
Type: System.Double
Poisson’s ratio.
A
Type: System.Double
The thermal coefficient. [1/T]
G
Type: System.Double
The shear modulus. For isotropic materials this value is program calculated from the modulus of elasticity and poisson’s ratio. [F/L2]
Temp (Optional)
Type: System.Double
the temperature at which the specified data is to be retrieved. The temperature must have been defined previously for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value. The function returns an error if the symmetry type of the specified material is not isotropic.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim e As Double
       Dim u As Double
       Dim a As Double
       Dim g As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Steel", eMatType.Steel)
   'assign isotropic mechanical properties
       ret = SapModel.PropMaterial.SetMPIsotropic("Steel", 29500, 0.25, 6E-06)
   'get isotropic mechanical properties
       ret = SapModel.PropMaterial.GetMPIsotropic("Steel", e, u, a, g)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace